数学分析1 = [75,4,2.5,10.0]
数学分析2 = [60,6,1.0,6.0]
数学分析3 = [66,6,1.6,9.6]
# 高等代数1 = [63,4,1.3,5.2]
高等代数1 = [88,4,3.8,15.2]
高等代数2 = [71,6,2.1,12.6]
# 解析几何 = [75,3,2.5,7.5]
解析几何 = [95,3,4.5,13.5]
#常微分方程 = [80,4,3.0,12.0]
常微分方程 = [65,4,1.5,6.0]
概率论与数理统计 = [60,4,1.0,4.0]
算法与数据结构 = [60,3,1.0,3.0]
# 算法与数据结构 = [66,3,1.6,4.8]
C艹程序设计 = [65,3,1.5,4.5]
总学分 = 43
总分 = 75 + 60 + 66 + 88 + 71 + 95 + 65 + 60 + 60 + 65
平均分数 = 总分/10
# 高等代数平时成绩 = 94*0.25 + 60*0.25
# print((88-高等代数平时成绩)*2)
# print((95-27)/0.7)
print(总分)
print(平均分数)
学分绩点 = 10.0 + 6.0 + 9.6 + 15.2 + 12.6 + 13.5 + 6.0 + 4.0 + 3.0 + 4.5
print(学分绩点)
平均学分绩点 = 学分绩点/43
print(平均学分绩点)